//=============================================================================
//
// バトルシーンヘッダ [BattleScene.h]
// Author : GP11A341 21 立花雄太
//
//=============================================================================
#ifndef _BATTLESCENE_H_
#define _BATTLESCENE_H_

#include "main.h"
#include "sceneManager.h"

// マクロ定義

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBattleScene(int num);							//プレイヤーバレット初期化処理
void UninitBattleScene(void);								//プレイヤーバレット終了処理
void UpdateBattleScene(void);								//プレイヤーバレット更新処理
void DrawBattleScene(void);								//プレイヤーバレット描画処理

#endif
