//=====================================
//
//キューブオブジェクトヘッダ[cubeObject.h]
//Author:GP11A341 21 立花雄太
//
//=====================================
#ifndef _CUBEOBJECT_H_
#define _CUBEOBJECT_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void InitCubeObject(int num);
void UninitCubeObject(int num);
void UpdateCubeObject(void);
void DrawCubeObject(void);

#endif