//=====================================
//
//デバッグシーン処理[debugScene.cpp]
//Author:GP11A341 21 立花雄太
//
//=====================================
#include "debugScene.h"
#include "DebugTimer.h"
#include "playerMissile.h"

/**************************************
マクロ定義
***************************************/
#define DEBUGSCENE_LABEL	"DebugScene"

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
プロトタイプ宣言
***************************************/

/**************************************
初期化処理
***************************************/
HRESULT InitDebugScene(int num)
{
	InitPlayerMissile(num);
}

/**************************************
終了処理
***************************************/
void UninitDebugScene(int num)
{
	UninitPlayerMissile(num);
}

/**************************************
更新処理
***************************************/
void UpdateDebugScene(void)
{
	UpdatePlayerMissile();
}

/**************************************
描画処理
***************************************/
void DrawDebugScene(void)
{
	DrawPlayerMissile();
}
