//=====================================
//
//エネミーホーミングバレットトレイル処理[enemyBullet.cpp]
//Author:GP11A341 21 立花雄太
//
//=====================================
#include "enemyBulletTrail.h"
/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/
static ENEMYBULLET_TRAIL bulletTrail[ENEMYBULLETTRAIL_MAX];
static ENEMYBULLET_TRAIL homingTrail[ENEMYBULLETTRAIL_MAX];

/**************************************
プロトタイプ宣言
***************************************/

/**************************************
初期化処理
***************************************/
void InitEnemyBulletTrail(int num)
{

}

/**************************************
終了処理
***************************************/
void UninitEnemyBulletTrail(int num)
{

}

/**************************************
更新処理
***************************************/
void UpdateEnemyBulletTrail(void)
{

}

/**************************************
描画処理
***************************************/
void DrawEnemyBulletTrail(void)
{

}
