//=====================================
//
//テンプレートヘッダ[flare.h]
//Author:GP11A341 21 立花雄太
//
//=====================================
#ifndef _FLARE_H_
#define _FLARE_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void InitFlare(int num);
void UninitFlare(void);
void UpdateFlare(void);
void DrawFlare(void);

#endif