//=============================================================================
//
// ロゴシーンヘッダ [LogoScene.h]
// Author : GP11A341 21 立花雄太
//
//=============================================================================
#ifndef _LOGOSCENE_H_
#define _LOGOSCENE_H_

#include "main.h"
#include "sceneManager.h"

// マクロ定義

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitLogoScene(int num);							//プレイヤーバレット初期化処理
void UninitLogoScene(void);								//プレイヤーバレット終了処理
void UpdateLogoScene(void);								//プレイヤーバレット更新処理
void DrawLogoScene(void);								//プレイヤーバレット描画処理

#endif
