//=========================================================
//
//メッシュシリンダーヘッダ［meshCylinder.h］
//Author：GP11A341 21 立花雄太
//=========================================================
#ifndef _MESHCYLINDER_H_
#define _MESHCYLINDER_H_

#include "main.h"

/*********************************************************
構造体定義
*********************************************************/

/************************************************************
プロトタイプ宣言
*************************************************************/
void InitMeshCylinder(int num);
void UninitMeshCylinder(int num);
void UpdateMeshCylinder(void);
void DrawMeshCylinder(void);


#endif