//=====================================
//
//テンプレートヘッダ[nameEntryScene.h]
//Author:GP11A341 21 立花雄太
//
//=====================================
#ifndef _TEMPLATE_H_
#define _TEMPLATE_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void InitTemplate(int num);
void UninitTemplate(int num);
void UpdateTemplate(void);
void DrawTemplate(void);

#endif