//=====================================
//
//テンプレート処理[nameEntryInput.cpp]
//Author:GP11A341 21 立花雄太
//
//=====================================
#include "nameEntryController.h"
#include "input.h"
#include "sceneManager.h"
#include "sceneFade.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
プロトタイプ宣言
***************************************/

/**************************************
入場処理
***************************************/
void OnEnterNameEntryEnd(NAMEENTRY *entity)
{
	SaveHighScoreData();
}

/**************************************
更新処理
***************************************/
void OnUpdateNameEntryEnd(NAMEENTRY *entity)
{
	if (GetAttackButtonTrigger())
	{
		SetSceneFade(TitleScene);
	}
}