//=============================================================================
//
// リザルトシーンヘッダ [ResultScene.h]
// Author : GP11A341 21 立花雄太
//
//=============================================================================
#ifndef _RESULTSCENE_H_
#define _RESULTSCENE_H_

#include "main.h"
#include "sceneManager.h"

// マクロ定義

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResultScene(int num);		//リザルトシーン初期化処理
void UninitResultScene(int num);		//リザルトシーン終了処理
void UpdateResultScene(void);			//リザルトシーン更新処理
void DrawResultScene(void);				//リザルトシーン描画処理

#endif
