//=====================================
//
//スクリーン背景ヘッダ[screenBG.h]
//Author:GP11A341 21 立花雄太
//
//=====================================
#ifndef _SCREENBG_H_
#define _SCREENBG_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void InitScreenBG(int num);
void UninitScreenBG(int num);
void UpdateScreenBG(void);
void DrawScreenBG(void);

#endif