//=====================================
//
//スカイBGヘッダ[skyBG.h]
//Author:GP11A341 21 立花雄太
//
//=====================================
#ifndef _SKYBG_H_
#define _SKYBG_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void InitSkyBG(int num);
void UninitSkyBG(void);
void UpdateSkyBG(void);
void DrawSkyBG(void);

#endif