//=====================================
//
//スモールエネミー待機処理[smallEnemyWait.cpp]
//Author:GP11A341 21 立花雄太
//
//=====================================
#include "smallEnemyModel.h"

/**************************************
マクロ定義
***************************************/
#define SMALLENEMY_WAIT_END		(180)

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
プロトタイプ宣言
***************************************/

/**************************************
入場処理
***************************************/
void EnterSmallEnemyWait(SMALLENEMY *enemy)
{
	enemy->cntFrame = 0;
}

/**************************************
更新処理
***************************************/
void UpdateSmallEnemyWait(SMALLENEMY *enemy)
{
	enemy->cntFrame++;

	if (enemy->cntFrame == SMALLENEMY_WAIT_END)
	{
		ChangeStateSmallEnemy(enemy, SmallEnemyAttack);
	}
}

/**************************************
退場処理
***************************************/
void ExitSmallEnemyWait(SMALLENEMY *enemy)
{

}