//=============================================================================
//
// ロゴシーンヘッダ [TitleScene.h]
// Author : GP11A341 21 立花雄太
//
//=============================================================================
#ifndef _TITLESCENE_H_
#define _TITLESCENE_H_

#include "main.h"
#include "sceneManager.h"

// マクロ定義

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitleScene(int num);							//プレイヤーバレット初期化処理
void UninitTitleScene(void);								//プレイヤーバレット終了処理
void UpdateTitleScene(void);								//プレイヤーバレット更新処理
void DrawTitleScene(void);								//プレイヤーバレット描画処理

#endif
