//=====================================
//
//チュートリアル終了処理[tutorialEnd.cpp]
//Author:GP11A341 21 立花雄太
//
//=====================================
#include "sceneFade.h"
#include "bgmManager.h"

/**************************************
マクロ定義
***************************************/
#define TUTORIAL_END_FADE_DURATION		(60)

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
プロトタイプ宣言
***************************************/

/**************************************
入場処理
***************************************/
void OnEnterTutorialEnd(void)
{
	FadeOutBGM(BGM_TUTORIALSCENE, TUTORIAL_END_FADE_DURATION);
	SetSceneFade(BattleScene);
}

/**************************************
更新処理
***************************************/
void OnUpdateTutorialEnd(void)
{

}

/**************************************
描画処理
***************************************/
void OnDrawTutorialEnd(LPDIRECT3DTEXTURE9 tex)
{

}